using EmptyMVCShop01.Models;
using Microsoft.Identity.Client;

namespace EmptyMVCShop01
{
    public class Comments
    {
        //توی پروژه که زیر سلوشن هست ما یک
        //Connected Services
        //داریم
        //حالا کانکتد سرویسس چیکار میکنه ؟ کارش اینه که کمک میکنه سرویس هایی رو که لازم داریم رو بتونیم رفرنس بدیم
        //حالا سرویس چیه؟ هر کلاسی که توسط نرم افزارمون استفاده بشه سرویس است
        //بعدیش دیپندنسیس هست که رفرنس های مارو لیست میکنه
        //توی پوشه پراپرتیز لانچ ستینگ دات جیسان هست کاری میکنه که اپ لانچ بشه و ران بشه
        //بعدی اپ ستینگ دات جیسان هست که برای ذخیره اطلاعات کانفیگ و کانفیگوریشن هست مثلا
        //اضافه کردن کانکشن به دیتا بیسمان و ستینگ ها
        //داب داب داب روت هست که الان اینجا نیست این یه پروژه امپتی هست که بعد ها میسازیمش
        //بعد داخل این پوشه داب داب داب روت ما فایل های استاتیک رو ذخیره میکنیم 
        //فایل استاتیک چیه ؟ فایلی هست که تعغیر نمیکنه یا با
        //ریکوست های مختلف ولیو ها و مقادیرشون تعغیر نمیکنه مثل یه صفحه سی اس اس یا یک ایمیج یا
        //یک صفحه اچ تی ام ال در کل فرانت سایت پس همه فایل هایی که براوزر برای نشون دادن وب سایت ما لازم داره
        //       ~/wwwRoot/Image.jpeg
        //       http://MyWebSite.Com/Image.jpeg
        //
        //csproj 
        //اگه کیلیک کنیم روی اسم پروژه یه صفحه باز میشه با نام پروژه که بهش میگن سی اس پروژه
        //توش ما دیپندنسی ها اد میشن و اس دی کی مایکروسافت اد میشه ورژن دات نتی که تارگت هست مشخص میشه و چیز های دیگه
        //توی سی اس پروژه یک خط کد داریم با کد زیر
        //    <ImplicitUsings>enable</ImplicitUsings>
        //کارش اینه که در دات نت 6 اومده اینو اورده تا
        //یوزینگ های دیفالت و پایه دیگه نوشته نشوند و در موقع کامپایل خودشون خود به خود به وجود بیان
        //
        //program.cs
        //توی خود پروگرام سی اس توضیح دادم
        //
        //کنتورلر ها هستند که ریکوئست هایی که به سمت سرور فرستاده میشوند از سمت اینتراکشن کاربر رو دریافت میکنن
        //و پاسخ مناسب به اون ریکوئست ها رو مهیا میکنن براساس اینتراکشن کاربر ریسپانس میدن
        //کنترلر در ریسپانس به اینتراکشن کاربر مدل رو اپدیت میکنه و
        //انتخاب میکنه که کدوم ویو در ریسپانس به اینتراکشن کاربر نشون داده بشه تا اطلاعات مدل رو نشون بده
        //وقتی ریکوئست میاد و کنترلر میگیرتش یک متد از کنترلر رو اینووک میکنه . این متد ها اسمشون اکشن یا اکشن متد هست
        //
        //Views
        //فولدر ویوز توش ویو ها نگهداری میشن اوکی
        //در فولدر ویو ما ساب فولدر هایی داریم که هم نام کنترلر های ما هستند
        //موقع ساخت کنترلر مثلا نوشتیم پای کنترلر ولی اسم این کنترلر پای کنترلر نیست بلکه پای هست پای خالی
        //حالا توی این ساب فولدر ها ما ویو داریم . از کجا بفهمیم که چه ویو یی را نشون بدیم
        //خب کنترلر ها متد دارند بعضی از این متد ها اکشن متد هستند که ای اکشن ریزالت و اکشن زیزالت برمیگردونن
        //اکثرا ویو ریترن میکنن یا ریدایرکت میکنن توی یک ویو
        //اسم این متد ها یا همون اکشن ها یا اکشن متد ها دقیقا هم نام ویو ها هستند پس
        //هروقت یکی از این اکشن ها ویو یی رو فرتخوانی میکنه ویویی میاد که هم اسم اکشن هست
        //در ویو ما اچ تی ام ال کد میزنیم و سیشارپ پس پسوندش سی اس اچ تی ام ال هستش
        //سی شارپ رو در قالب ریزور کد میزنیم یعنی با اتساین پشت سرش
        //توی ویو از لاجیک و چیز های دیگر استفاده نمیکنیم و نهایتن از ایف و حلقه استفاده کنیم . باید استفاده از سی شارپ رو کم کنیم
        //از ویوبگ کمتر استفاده میکنیم . ویوبگ را در اکشن مربوط به اون ویو مقدار دهیش میکنیم و
        //بعد با ریزر درون ویو استفادش میکنیم
        //ViewBag
        //
        //لی اوت
        //_layout
        //لی اوت میره توی پوشه شیرد
        //پوشه ای هسست که دیفالت ای اس پی میگرده دنبالش تا فایل هایی که بین همه فایل های دیگه مشترک هست رو پیدا کنه
        //الان ما برای اولین ویو خودمون یعنی ویو پای لیست دات سی اس اچ تی ام ال
        //نشستیم از صفر صفر یک اچ تی ام ال کد زدیم
        //این موضوع باعث میشه که اگه یه وقت بخوایم مثلا به نو بار چیزی رو اضافه کنیم باید بیایم و
        //دستی تمام اچ تی ام ال های ویو رو تعغیر بدیم که کار پر از اشتباه  طولانی هست
        //در عوض میایم در پوشه شیرد یک لی اوت میسازیم که در واقع یک تمپلیت برای تمام ویو های پیج ما هست
        //درون لی اوت یک کد ریزور وجود داره به اسم 
        //@RenderBody()
        //این رندر بادی اکثرا در بادی اچ تی ام ال و در تگ مین است
        //رندر بادی جایی است که کانتنت ویو های ما نمایش داده میشود
        //در واقعا اچ تی ام ال هر ویو ما رندر میشود و بعد در رندر بادی در
        //تگ مین بخش بادی لاچ تی ام ال فایل لی اوت نمایش داده میشود
        //باقی تگ ها مثل تگ هد و داک تایپ تایتل درون تگ هد و متا کر ست ها لینک های سی اس اس درون لی اوت هستند و
        //درواقع ما فقط در ویو ها در بخش مین بادی کد اچ تی ام ال میزنیم و اگر به کد هایی بیرون از
        //مین بادی نیاز داشته باشیم برای تعغیر میریم به لی اوت که البته روی تمام ویو ها تاثیر میگذارد و یا این که
        //متغیری برای تگ های بیرون از مین بادی تعریف کنیم که در ویو ها به ان ها دسترسی پیدا کنیم و از انجا تگ هایی مثل تایتل در 
        //تگ هد و متا کر ست ها را کاستومایز کنیم مختص هر ویو بدون انکه روی ویو های دیگر تاثیر بگذارد
        //وقتی که ویو رندر یشه ای اس پی اتومات میگررده دنبال یه فایل سی اس اچتی ام ال دیگه به اسم ویو استارت
        //_ViewStart
        //میایم کد هایی که میخوایم دیفالت توی ویو ها باشه رو مینویسیم اونجا . کد هایی ریزور رو
        //منظورمه حالا با یه مقدار اچ تی ام ال شاید
        //بعد با کلمه کلیدی لی اوت توی ویو استارت مشخص میکنیم که این کد ها برای کدوم ویو اجرا بشوند
        //مثلا لی اوت مساوی با لی اوت
        //این شکلی کد هایی که در اون بخش از ویو استارت هستند برای ویوی لی اوت نمایش داده میشن
        //برای لی اوت ما سه تا سی اس اچ تی ام ال اد میکنیم 
        //_Layout
        //_ViewStart
        //_ViewImports
        //
        //Shared
        //فولدر شیرد در فولدر ویو قرار میگیره و بین همه ویو ها شیر میشه
        //برای درست کردن لی اوت نیو ایتم که زدیم میزنیم ساخت ریزور لی اوت تا دیفالت لی اوت رو بسازه
        //
        //برای ساخت ویواستارت دیگه درون پوشه شیر نمیریم یک راست در پوشه ویو یک ایتم جدید اد میکنیم به اسم
        //ریزور ویو استارت
        //در ویو استارت مشخص میکنیم که لی اوتی که برای ویو ها هست کدام فایل هست
        //فایل بعدی که اضافه میکنیم ویو ایمپورت هست
        //اون هم درون پوشه ویو و بعد اد نیو ایتم و ریزور ویو ایمپورت 
        //در ویو ایمپورت یوزینگ هایی که اکثرا توسط ویو ها استفاده میشوند رو مینویسیم
        //
        //برای اد کردن لایبرری های کلاین ساید ما از لایبرری منیجمنت استفاده میکنیم نه ناگت یا حالا نوگت
        //روی پروژه کلیک راست اد کلاینت ساید لایبرری
        //پرووایدرش برابر با سی دی ان جی اس
        //بعد هم سرچ میکنیم بوت استرپ اینتر میزنیم و جدید ترین ورژنش رو میاره با اعداد جلو ورژنش
        //بعد مشخص میکنیم کدوم فایل هاش رو میخوایم . بزاریم دیفالت باشه
        //بعد میگه توی کدوم فولدر و ادرس باشه ؟
        //ما میایم پشت اون ادرسی که نوشته مینویسیم 
        //wwwroot/
        //چون یک فایل(چندین فایل) استاتیک هست و پوشه داب داب داب روت مال استاتیک هاست
        //اگه نباشه ساخته میشه اگه باشه توش اینستال میشه
        //بعد هم یک لیب من دات جیسان ایجاد میشه توی پروژه
        //که اومده با جبسان مشخصات لایبرری بوت استرپ رو که تازه اد کردیم مشخص کرده این که چه ورژنی هست اینکه کجا ذخیره هست
        //اینکه با چه پروایدری اومده و ورژن پرووایدر چی بوده
        //حالا میخوایم جی کوئری رو هم اد کنیم 
        //دوباره همین مسیر رو میریم
        //روی پروژه راست کلیک . کلاینت ساید لایبرری رو اد میکنیم و ...ه
        //ایندفعه خودش داب داب داب روت رو که ما ایجاد کرده بودیم رو اورده بود توی ادرس
        //
        //بعد هم اینکه یک قسمت دیگه که ساخت فولدر سی اس اس برای استایل دادن کاستوم خودمون هست و پوشه ایمیجز
        //اینا رو از توی خود اسست اموزش دوره اوردم : فایل سی اس اس و عکسا
        //حالا میریم توی پوشه شیرد و لی اوت و توی هد جیکوئری بوتاسترپ و سی اس اس کاستوم خودمون رو اضافه میکنیم
        //
        //
        //ای اف کور 
        //ای اف کور فقط از کد فرست ساپورت میکنه
        //برای ای اف کور باید پکیج هایی رو از ناگت اد کنیم
        //یکیش مایکروسافت دات انتیتی فریمورک دات اسکیو ال هست که برای این هست که ای اف کور بتونه با اس کیو ال کار کنه
        //بعدی هم مایکروسافت دات انتیتی فریمورک دات تولز هست که برای این هست که
        //با کنسول پکیج منیجر بتونیم دستورات انتیتی فریمورک را
        //بنویسیم و انتیتی فریمورک اجرا کنه
        //
        //حالا از اونجا که ای اف کور کد فرست هست میاد از روی دامین کلاس های ما و پراپرتی هاش انتیتی هارو میسازه 
        //ما تا الان چنتا دامین کلاس ساختیم
        //وقتی انتیتی فریمورک میاد کلاس هارو نگاه میکنه از اسم اون کلاس برای نام دادن تیبل استفاده میکنه ولی
        //به صورت جمع یعنی جمع میبندتش
        //پراپرتی ها هم سطون هارو تشکیل میدن و پراپرتی که ای دی داره میشه پرایمری کی
        //یعنی پراپرتی هایی که ایدی هستن اسمشون یا توی اخر اسمشون ای دی دارن تبدیل به پرایمری میشن
        //بعد مثلا ما توی کلاس پای یک اینت کتگوری ایدی هم داریم و بعد یک کلاس به اسم کتگوری داریم که اونم کتگوری ای دی دارد
        //در اینصورت کتگوری ایدی میشود فارن کی 
        //بعد ما یک کلاس دی بی کانتکست میسازیم که مثل پل بین اپ ما و دیتا بیس ما هست و
        //بعد هم باید کانکشن استرینگ رو بیاریم که خب به یه دیتا بیسی باید وصل بشه دیگه
        //کجا میاریمش؟ توی اپ ستینگ دات جیسون
        //توی پراگرام دات سی اس هم یکم کد کانفیگی داریم که خب چون سرویس ها و پکیج های مختلفی رو اوردیم دیگه
        //ای اس پی خیلی ماژولار هستش و پس باید چیز هایی که میخوایم رو اضافه کنیم هی
        //توی پرگرام دات سی اس از بیلدر دات سرویس دات اد دی بی کانتکست که یک اکستنشن متد هست استفاده میکنیم تا
        //دیتا بیس کانتکس ما رجیستر بشه
        //ما کانکشن استرینگ رو میفرستیم و دی بی کانتکست رو میفرستیم و ناگت پکیج هارو میفرستیم تا بتونیم ازشون استفاده کنیم
        //
        //خب اولین کار اد کردن پکیج ها با ناگت
        //خب بعد اطلاعاتش تیو سی اس پراجک میاد که همونیه که اگه روی پروژه کلیک کنیم میاد
        //خب حالا بریم دیتا بیس کانتکس رو بسازیم
        //خب میریم توی پوشه مادلز و یه کلاس با اسم پروژهبه همراه دی بی کانتکست میسازیم و از دیبیکانتکست م ارث بری میکنیم
        //
        //
        //کانکشن استرینگ رو نوشتیم چجوری نوشتیم ؟ به اپ ستینگ نگاه کنیم
        //https://www.connectionstrings.com/
        //از این سایت کمک میگیریم
        //بعد هم چون حالا من اس کیو الم سرتیفیکیتش ساین نشده و ترو نیست میایم و
        //کد پایین رو اضافه میکینیم به درون انتهای کانکشن استرینگمون
        //TrustServerCertificate=True;
        //
        //میگریشن یعنی محاجرت از یک محیط به محیط دیگر خب ما الان میخوایم که کلاس ها و پراپرتی های توش رو برداریم ببریم اس کیو ال
        //
        //Add-Migration: Creates a new migration class as per specified name with the Up() and Down() methods.
        //Update-Database: Executes the last migration file created by the Add-Migration command and
        //applies changes to the database 
        //
        //خب حالا برای اینکه دیتا رو وارد دیتا بیس کنیم میایم و یک کلاس برای سید دیتامون درست میکنیم در پوشه مادلز
        //
        //
        //پارشال ویو ها
        //پارشال ویو مال وقتی هست که ما یک ویو داریم و اون ویوی یک کار خاصی رو انجام میده و
        //یک ویو دیگر هم داریم و کار قبلی رو انجام میده
        //اینجا ما جای اینکه از چند ویوی مختلف ولی با کار همسان استفاده کنیم میایم و از یک پارشال ویو استفاده میکنیم
        //پارشال ویو ها با اندرلاین و بعد حرف بزرگ شروع میشوند و در پوشه شیرد ویو قرار میگیرند
        //اول یک ویو در پوشه شیرد بسازیم
        //بعد در جایی که میخوایم از کد های پارشال ویو استفاده کنیم از تگ هلپر پارشال استفاده میکنیم
        //و اتربوت نیم رو که میگه اسم پارشال ویو چی هست رو پر میکنیم و چون در پوشه شیرد هست نیازی به ادرس دهی نیست
        //
        //
        //خب حالا وقتی که ما در خواستی رو ارسال کنیم بعد از انجام اون درخواست و ریکوپست اون ریکوپست حذف میشه
        //پس مثلن توی سبد خرید مشتری وقتی چیزی رو اضافه میکنه بعد که میره صفحه بعد اون چرخ خرید حذف میشه اگه ما جایی ذخیرش نکرده باشیم
        //حالا اگه کاربرمون بدون درست کردن حساب کاربری بخواد خرید انجام بده چی؟ اون موقع کجا ذخیره کنیم 
        //میایم و با سشن ها ذخیره میکنیم 
        //سشن ها اطلاعات رو در کوکی ها ذخیره میکنن و اینشکلی هست که ذخیره میشه تا وختی ریکوئست انجام شد اطلاعاتش حذف نشه
        //در کوکی ذخیره میشه و بر اساس ای پی و مرورگر طرف ذخیره میکنه
        //و این که ما هر ریکوئست سبد خرید رو بایک جی یو ای دی 
        //GUID 
        //مشخص میکنیم که ای دی یونیک داشته باشه برای کاربر ها
        //مثل باقی ابزارهای فریمورک باید اضافه بشه ولی چون دیفالت هست لازم نیست که
        //از ناگت پکیج استفاده کنیم و همین جوری میایم و اضافش میکنیم در پرگرام دات سی اس
        //مینویسم اد سشن
        //و بعد مینویسیم یوز سشن
        //
        //
        //ویو کامپوننت
        //مشابه پارشال ویو هستند با این تفاوت که پارشال ویو یک تک دیتا بهش بر اساس کنترلری که صداش میزنه و ویو مادر میرسه ولی
        //چی میشه اگه چنتا دیتا به خایم بدیم بهش و اینا ؟ اون موقع میایم از ویو کامپوننت استفاده میکنیم که
        //بخش کد زدن و لاجیک مجزای خودش رو داره
        //از اونجایی که هم لاجیک خودش رو داره هم با دیتا بهتر و وسیع تر کار میکنه و از دیپندنسی اینجکشن پشتیبانی میکنه پس
        //میشه ازش در فرم های لاگ این استفاده کرد
        //برای نویگیشن داینامیک که بر اساس اینکه کاربر لاگ این کرده یا نه تفاوت کنه
        //و برای سبد خرید که خب ایتم های مختلف توی سبد هستند
        //ویو کامپوننت کلاس
        //یک کلاس ویو کامپوننت میسازیم که از ویو کامپوننت ارثبری میکنه و پابلیک هست و ابسترکت هم نیست
        //کاری که میخوایم انجام شه را درون متد اینووک مینویسیم که باید باشهد چون ای اس پی به صورت دیفالت میگرده دنبالش و برامون میارتش
        //در مسیر پوشه ویو پوشه شیرد پوشه کامپوننتس و پوشه ای که هم اسم کلاس کامپوننت ویو هست و ویو اونجا قرار میگیره با اسم دیفالت 
        //برای کلاس کامپوننت ویوها یک فولدر میسازیم به اسم کامپوننتس در پروژه و بعد در انج یک کلاس ساده میسازیم
        //
        //
        //
        //درست کردن تگ هلپر کاستوم
        //تگ هلپر چیکار میکنه؟
        //تگ هلپر باعث میشه کد های سی شارپ سمت سرور در رندر شدن و
        //ساخته شدن صفحات اچ تی ام ال با کد های اچ تی ام ال همکاری کنند در ریزر فایل 
        //تگ هلپر ها هاوی سی شارپ اند و اون سی شارپ باعث ساخته شدن اچ تی ام ال میشه
        //تگ هلپر با استفاده از سی شارپ ساخته میشوند . تگ هلپر ها یک کلاس اند که از کلاس تگ هلپر ارث میبرند
        //تگ هلپر ها سرور ساید اند که باعث ساخته شدن اچ تی ام ال میشوند
        //
        //برای ساخت تگ هلپر
        //یک فولدر بسازیم در پروژه ویک کلاس در ان اد کنیم
        //حالا از کلاس تگ هلپر در نیم اسپیس مایکروسافت دات ای اس پی نت کور دات ریزور دات تگ هلپر ارث بری میکنیم
        //الان اسم کلاس تگ هلپر ما به این شکل هست
        //EmailTagHelper
        //ای اس پی میاد و به صورت دیفالت تگ هلپری با اسم 
        //Email
        //میسازه یعنی به صورت دیفالت اسم تگ هلپر برابر با کلمه یا کلمات پشت کلمه تگ هلپر است
        //خب حالا بریم توی کلاسمون
        //
        //
        //
        //الان ما فرم رو درست کردیم 
        //فرم پست هم میکنه
        //ولی به دیتاش دسترسی نداریم
        //اگه بخوایم دستی ریکوئست های اچ تی تی پی رو بگیریم
        //یه عالم کد میخواد
        //ولی با مدل بایندینگ دیگه نمیخواد خودش میاد اینپوت های پست شده رو میبره توی اکشن ما و پارامتر هایی از 
        //اکشن متد را که نیازه پر بشن پر میکنه
        //
        //
        //
        //
        //خب حالا کاربران باید وقتی فرم رو پرمیکنند با دیتایی پر کنند که بشه مدل بایندینگشون کرد و پراپرتی های ابجکت کلاسمون رو 
        //به درستی پر کنه
        //ولیدیشن لازم داریم 
        //ولیدیشن رو همون مدل استیت انجامش میده
        //پیغام خطا رو هم همون مدل استیت نشونش میده
        // و در اخر چک میکنه ایز ولید؟ اگر تروو بود که حله
        //IsValid
        //GetValidationState
        //AddModelError
        //و اینکه میتونیم ولیدیشن اتربیوت هم به کلاس مدل مان اظافه کنیم که خود مدل ولیدیشن رو انجام بده
        //چنتا از اتربیوت ها
        //Required 
        //ما وقتی هست که یک پراپرتی لازم باشد اینو برای اون پراپرتی میزاریم
        //StringLength
        //برای مشخص کردن کمترین و بیشترین تعداد کارکتر پراپرتیمون
        //Range
        //پراپرتی عددیمون توی رینج و بازه مشخص ما هستش یا نه
        //RegularExpression
        //اتربیوت رگولار اکسپرشن که مخففش میشه رجکس
        //regex
        //رگولار اکسپرشن یا رجکس میاد و یک الگوی متنی رو چک میکنه
        //A regular expression is a sequence of characters that specifies a match pattern in text.
        //A regular expression (also called regex or regexp) is a way to describe a pattern
        //to locate or validate specific strings or patterns of text in a sentence, document, or any other character input.
        //با رگولار اکسپرشن میشه مثلا ایمیل و شماره تلفن رو هم ولیدیشنش رو چک کرد 
        //ولی هم ایمیل و هم شماره تلفن اتربیوت خودشون رو دارن
        //EmailAddress
        //Phone
        //اتربیوت های شماره تلفن و ایمیل
        //بعد خب ما پیام های ولیدیشن رو هم باید نشون بدیم دیگه ، درواقع ارور مسیج هارو
        //ارور مسیج ها رو میتونیم توی ویو با تگ هلپر 
        //asp-validation-summery
        //نشون بدیم
        //کلاس این تگ هلپر میاد میره توی اکشن متدش و میگرده دنبال خطا و اگه اروری بود پیامش رو میگیره و میاد 
        //در جایی که این تگ هست که اکثرن داخل تگ های فرم در یک دیو هست نشونش میده
        //خب حالا بریم توی مدل اوردرمون و اتربیوت های ولیدیشن رو اضافه کنیم
        //
        //
        //
        //
        //خب این تا اینجا ام وی سی بود
        //حالا میخوایم بریم ریزور پیجز
        //برای ریز پیجز نیازی نیت که ما کنترلر بسازیم
        //یکدونه ویو داره با پسوند همون سی اس اچ تی ام ال
        //اون سی اس اچ تی ام الش یکدونه کد بیهایند داره
        //که از کلاس 
        //PageModel 
        //ارث بری کرده
        //روتینگ توی ریزور پیجزبا روتینگ توی ام وی سی متفاوته
        //و بر اساس فایل هستش
        //میتونیم ریزور پیجز و ام وی سی رو با هم استفاده کنیم
        //از ام وی سی برای پیج هایی که لاجیک پیچیده ای دارن استفاده میکنیم
        //خب برای استفاده ازش توی پروژه ما باید بریم توی پرگرام دات سی اس و این فریمورک رو رجیستر کنیم 
        //بعد از رجیستر سرویس حالا رجیستر میدلور ان با استفاده از 
        //app.MapRazorPages
        //چرا میدل ور رو اد کنیم چون گفتم که این روتینگش متفاوته و میاد اینفایل هایی که
        //توی فولدر پیجز هستند رو به عنوان اند پوینت ریزور پیجز مشخص میکنه
        //در فایل ریزور پیجز ما در ابتدای کد ها از 
        //@page
        //استفاده میکنیم چون ما کنترلر و اکشن متد نداریم از این استفاده میکنیم و این فایل ریزور پیجز رو تبدیل میکنه به ام وی سی
        //ات پیج همیشه باید اولین خط باشه و اینکه فایل ریزور پیج میره داخل فولدر پیجز
        //کد بی هایند ریزور پیجز با ویو ان هم نام هست با این تفاوت که بعد از سی اس اچ تی ام ال پسوند دات سی اس دارد 
        //کد بی هایند که از پیج مادل ارث بری میکنه هندلر متد داره که از پیج مادل میان
        //OnGet()  &  OnPost()
        //این دوتا هندلر کار پست و گت رو انجام میدن و اکشن ریزالت بر میگردونن
        //خب حالا بریم و سرویس ریزر و میدل ور ان را اضافه کنیم و 
        //حالا نیازه که فولدر پیجز رو بسازیم چون اون فولدری هست که به صورت دیفالت روتینگ ریزور پیجز بهش رجوع میکنه
        //بعد داخل اون فولدر ریزر پیج میسازیم حواسمون باشه ریزر ویو نسازیم
        //کد بی هایند ش هم زیر مجموعه و همنام همین ریزور پیجی هست که ساختیم و
        //
        //
        //
        //
        //یونیت تست
        //یونیت تست کد هایی هستند که به شکل اتومات میان و عملکرد و رفتار یونیت ها و بخش های کد ما رو میسنجن
        //یک یونیت همون بلاک کد هست که خب کوچیکترینش متد ها هستند
        //اکثرن میان و متد های پابلیک رو میسنجن که بتونن دسترسی داشته باشن کدهای یونیت تست میان یونیت هارو در حالت
        //ایزوله و مسقل چک میکنن پس رفرنس ها مشکل ساز میشه البته چون ما دیپندنسی اینجکشن استفاده میکنیم جای نگرانی وجود نداره چون 
        //میتونیم راحت از دیپندنسی اینجکشن با استفاده از یک نمونه ماک اون متد یا کلاس خارجش کنیم و تستش کنیم
        //یونیت تست باید سه ویژگی داشته باشه
        //یک نتایجش مستمر باشه یعنی وقتی چندین بار یک یونیت تست میشه نتایج تست یکسان باشه که چون ایزوله هستند اکثرن این اتفاق میفته
        //دو اینکه به صورت خودکار تست هارو انجام بده
        //سه اینکه سریع باشه چون یک نرم افزار چندین تست داره و چندین بار تست میشه
        //یکی از بهترین راه ها برای داکیومنت کردن کد و افزایش بهره وری کد
        //و افزایش کیفیت کد و جلوگیری از کار نکردن تعغیرات و پیدا کردن باگ ها یونیت تست و نتایج و سوابق یونیت تست هست
        //نوشتن یونیت تست
        //AAA Approach
        //arrange ترتیب دادن
        //act عمل کردن
        //assert ادعا کردن
        //بیشتر یونیت تست ها از این رویکرد پیروی میکنن
        //اول از همه ما باید برای تست بعضی چیز ها رو مهیا کنیم . این از بخش ارینج
        //اکت هم مال وقتی هست که کد های تست رو اگزکیوت میکنیم
        //اسرت هم برای نتایج تست و تایید نتایج تست هستش
        //در بیشتر یونیت تست ها ما یک عدد اسرشن داریم ولی بعضی جاها هم چند تا برای یک تست
        //
        //یونیت تست فریمورک های داره ما از فریم ورک اکس یونیت استفاده میکنیم
        //xUnit
        //بعد لازمه که ماک ورژن هر کدوم رو هم ما بسازیم
        //پس باز ما از فریم ورک 
        //Moq
        //استفاده میکنیم
        //
        //نمونه یک تست
        //
        //public void CanUpdatePiePrice()
        //{
        //    //Arrange
        //    var pie = new Pie() { Name = "Simple Pie", Price = 12 };
        //
        //    //Act
        //    pie.Price = 20;
        //
        //    //Assert
        //    Assert.Equal(20, pie.Price);
        //}
        //
        //خب برای اضافه کردنیونیت تست ما باید در داخل سلوشن یک پروژه جدید اضافه کنیم پس کلیک راست روی پروژه و
        //اد نیو پروژکت . این پروژه 
        //xUnit 
        //هستش . سرچ میکنیم اک یونیت رو و اضافه میکنیم همون پروژه رو
        //پروزه اکس یونیت تست پروژکت رو انتخاب میکنیم دقت کنیم زبان سی شارپش رو
        //انتخاب کنیم هم اسم پروژه خودمون با یک تستس اضافه در اخرش
        //دیفالت یک عدد فایل دات سی اس به اسم یونیت تست یک وجود داره . اون رو پاکش کنیم و مال خودمون رو درست کنیم
        //اگه رو اسم پروژه تستمون کلیک کنیم میبینم که اکس یونیت رفرنس داده شده حالا ما
        //در تگ ایتم گروپ میایم و پکیج ماک رو رفرنس میدیم خودمون با تگ  پکیج رفرنس
        //همچنین ما باید پروژه خودمون رو هم به پروژه تست رفرنس بدین تا بشه تستش کرد
        //پس روی پروژه تست کلیک راست اد پروژکت رفرنس
        //بعد میبینیم که رفرنسش به رفرنس های پروژه تست اضافه شده در تگ ایتم گروپ جدا
        //خب حالا مثلن ما میخوایم که یک کنترلر رو تست کنیم
        //این کنترلر مثلن داره از دیپندنسی اینجکشن استفاده میکنه و کانستراکتورش دو تا ایتم میگیره مثلن 
        //پای کنترلر دوتا داره یکی ای پای ریپوزیتوری و یکی هم ای کتگوری ریپوزیتوری
        //کانستراکتور پای کنترلر لازم داره این دو ایتم رو این ایتم ها با دیپندنسی اینجکشن محیا میشوند ولی اینجا در تست
        //ما باید ورژن ماک ان هارو درست کنیم
        //و میخوایم پای لیست رو تست کنیم اول ببینیم که چیکار میکنه
        //یه استرینگ میگیره چک میکنیم اگه خالی بود همه کتگوری هارو برمیگردونیم و کورنت کتگوری هم میشه ال پایز 
        //اگر خالی نبود میاد پای ها رو فیلتر میکنه و فقط پای های همون کتگوری برابر با استرینگ رو نشون میده و
        //کورنت کتگوری هم میشه هم اسم کتگوری که با استرینگ برابر هست و بعد
        //ویو مدلی رو به عنوان پارامتر به ویو میفرسته که خودش به عنوان پارامتر پای های انتخاب شده توسط کتگوریشون و
        //مقدار کورنت کتگوری رو دریافت میکنه
        //خب حالا ما توی پروژه تست یک فولدر میسازیم فقط برای اینکه همه چیز مرتب باشه اسمش رو هم میزاریم کنترولر که
        //یعنی کنترلر هارو توش تست میکنیم
        //یک کلاس پابلیک میسازیم اون تو 
        //لازم نیست این کلاس از چیزی هم ارث بری کنه
        






















































    }
}
