using Microsoft.AspNetCore.Identity.EntityFrameworkCore;
//نیم اسپیس مورد نیاز ایدنتیتی دی بی کانتکس
using Microsoft.EntityFrameworkCore;
//برای ارث بری از دی بی کانتکست یوزینگ میشه
//و باید از قبل پکیج های ناگت رو اد کرده باشیم


namespace EmptyMVCShop01.Models
{
    //public class EmptyMVCShop01DbContext:DbContext
    //این بالایی داره از دیبی کانتکس خالی ارث بری میکنه ولی پایینی داره از ایدنتیتی دی بی کانتکس ارث بری میکنه
    //این جوری دیبی کانتکس درباره یوزر و این که رول یوزر چیه و چه نقشی داره و اینکه یوزر کی هست و اطلاعاتش چیه اطلاع پیدا میکنه
    //البته که باید نیم اسپیسش یوزینگ بشه
    //بعد از این بریم توی پرگرام دات سی اس و میدل ور اتنتیکیشن رو اضافه کنیم تا دی بی کانتکس کارش رو بتونه انجام بده
    public class EmptyMVCShop01DbContext:IdentityDbContext
    {
        //یک: کانستراکتور میسازیم کهیک اینستنس از دی بی کانتکست اپشن داشته باشه
        public EmptyMVCShop01DbContext(DbContextOptions<EmptyMVCShop01DbContext> options) : base(options) 
        {

        }

        //دو: حالا باید دی بی کانتکست ما بیاد و بر اساس کلاس ها و پراپرتی های ما این دی بی ست پر کنه و بسازه
        public DbSet<Category> Categories { get; set; }
        //میبینم که اسمش بر اساس کلاس ما هست ولی جمع هست
        public DbSet<Pie> Pies { get; set; }

        //سه حالا میریم تو اپ ستینگ تاکانکشن استرینگ رو اوکی کنیم
        //چهار : حالا میریم توی پرگرام دات سی اس تا اد کنیم سرویس هارو

        public DbSet<ShopingCartItem> ShopingCartItems { get; set; }
        //حب حالا اینجا این از دیتا بیس ما جلوتر هست پس باید میگریشن رو اپدیت کنیم تا این دوتا دوباره با هم سینک بشوند
        //مادلینگ کد ما جلوتر از دیتابیسمون هست. مدل دیتا بیسمون
        //یک میگریشن جدید باید بسازیم و بعد اپدیتش کنیم
        //خب حالا بعدش باید بریم و شاپینگ کارت رو بسازیم . میریم و یک اینترفیس میسازیم


        public DbSet<Order> Orders { get; set; }
        public DbSet<OrderDetail> OrderDetails { get; set; }    
        //اوکی بریم پرگرام تا ای اوردر ریپازیتوری رو رجیستر کنیم
        //بعد که میگریشن اد کردیم و اپدیت کردیم دیتا بیس رو 
        //بریم و کنترلر و ویو اوردر فرم رو بسازیم
    }
}
